# Exploratory Notebook

In [94]:
import pandas as pd
import sqlite3
import matplotlib as plt

## DATA DISCOVERY

- Connecting to im.db

In [95]:
#Connecting the im.db SQL database

conn = sqlite3.connect('../Data/im.db')

In [96]:
# Reading table movie_basic 
df_mb = pd.read_sql("""

SELECT *
FROM movie_basics

""", conn)

df_mb

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [97]:
df_mb.columns

Index(['movie_id', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')

In [98]:
df_mb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [99]:
df_mb['genres'].isna().sum()

5408

In [100]:
df_mb['runtime_minutes'].isna().sum()

31739

In [101]:
# DATA cleanning, we want to unify the database by dropping Null value from all columns
columns_to_drop_na = ['movie_id', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres']
df_mb.dropna(subset=columns_to_drop_na, inplace=True)

In [102]:
#Verification
df_mb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 112232 entries, 0 to 146139
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         112232 non-null  object
 1   primary_title    112232 non-null  object
 2   original_title   112232 non-null  object
 3   start_year       112232 non-null  int64
 4   runtime_minutes  112232 non-null  float64
 5   genres           112232 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.0+ MB

In [103]:
df_mb['genres'].isna().sum()

0

In [104]:
df_mb['runtime_minutes'].isna().sum()

0

#Data cleaning : Let's cleann the genres column
df_mb['genres'] = df_mb['genres'].str.split(',') 
df_mb = df_mb[df_mb['genres'].notnull()]
df_mb = df_mb.explode('genres')
df_mb.to_sql('cleaned_movies', conn, if_exists='replace')
df_mb

df_mb = df_mb[df_mb['genres'].notnull()]

df_mb = df_mb.explode('genres')

df_mb.to_sql('cleaned_movies', conn, if_exists='replace')
df_mb

## Movie_Ratings table

In [105]:
#Reading movie_ratings

df_mr = pd.read_sql("""

SELECT *
FROM movie_ratings

""", conn)

df_mr

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [106]:
df_mr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

## Movie_akas table

In [107]:
#Reading movie_ratings
df_ma = pd.read_sql("""

SELECT *
FROM movie_akas

""", conn)

df_ma

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [108]:
df_ma.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   movie_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [109]:
df_ma.columns

Index(['movie_id', 'ordering', 'title', 'region', 'language', 'types',
       'attributes', 'is_original_title'],
      dtype='object')

In [110]:
#Data cleanning
columns_to_drop_na = ['region', 'language', 'types' ]
df_ma.dropna(subset=columns_to_drop_na, inplace=True)

In [111]:
df_ma.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31069 entries, 8 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           31069 non-null  object
 1   ordering           31069 non-null  int64
 2   title              31069 non-null  object
 3   region             31069 non-null  object
 4   language           31069 non-null  object
 5   types              31069 non-null  object
 6   attributes         0 non-null      object
 7   is_original_title  31069 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 2.1+ MB

df_5a = pd.read_sql("""

SELECT *, MAX (averagerating) AS av_rating , MAX(numvotes) AS num_votes
FROM movie_basics
    JOIN movie_ratings 
       USING(movie_id)
    JOIN movie_akas ma
        USING(movie_id)
    GROUP BY movie_id
    ORDER BY num_votes DESC;

""", conn)

df_5a.head(10)

In [123]:
#Joining MOVIE RATING, BASICS, AKAS INTO df_m
df_m = pd.read_sql("""

SELECT movie_id, primary_title, runtime_minutes, genres, region, language, MAX (averagerating) AS av_rating , MAX(numvotes) AS num_votes
FROM movie_basics
    JOIN movie_ratings 
       USING(movie_id)
    JOIN movie_akas ma
        USING(movie_id)
    GROUP BY movie_id
    ORDER BY num_votes DESC;



""", conn)
df_m

,movie_id,primary_title,runtime_minutes,genres,region,language,av_rating,num_votes
0,tt1375666,Inception,148.0,"Action,Adventure,Sci-Fi",None,None,8.8,1841066
1,tt1345836,The Dark Knight Rises,164.0,"Action,Thriller",None,None,8.4,1387769
2,tt0816692,Interstellar,169.0,"Adventure,Drama,Sci-Fi",None,None,8.6,1299334
3,tt1853728,Django Unchained,165.0,"Drama,Western",None,None,8.4,1211405
4,tt0848228,The Avengers,143.0,"Action,Adventure,Sci-Fi",None,None,8.1,1183655
...,...,...,...,...,...,...,...,...
69572,tt10043732,Oblepikhovoe leto,87.0,"Biography,Drama",None,None,6.4,5
69573,tt10011772,Balloons over Babylon,70.0,Documentary,None,None,8.2,5
69574,tt10010134,Versailles Rediscovered - The Sun King's Vanis...,52.0,Documentary,None,None,7.0,5
69575,tt0844699,Ivan Mosjoukine ou L'enfant du carnaval,67.0,Documentary,FR,None,9.0,5
69576,tt0276568,To Chase a Million,97.0,"Action,Drama",GB,None,7.4,5

In [113]:
df_m.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69577 entries, 0 to 69576
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         69577 non-null  object
 1   primary_title    69577 non-null  object
 2   runtime_minutes  62830 non-null  float64
 3   genres           68937 non-null  object
 4   region           32697 non-null  object
 5   language         0 non-null      object
 6   av_rating        69577 non-null  float64
 7   num_votes        69577 non-null  int64
dtypes: float64(2), int64(1), object(5)
memory usage: 4.2+ MB

In [124]:
#more Data cleanning
columns_to_drop_na = ['runtime_minutes']
df_m.dropna(subset=columns_to_drop_na, inplace=True)

In [125]:
df_m

,movie_id,primary_title,runtime_minutes,genres,region,language,av_rating,num_votes
0,tt1375666,Inception,148.0,"Action,Adventure,Sci-Fi",None,None,8.8,1841066
1,tt1345836,The Dark Knight Rises,164.0,"Action,Thriller",None,None,8.4,1387769
2,tt0816692,Interstellar,169.0,"Adventure,Drama,Sci-Fi",None,None,8.6,1299334
3,tt1853728,Django Unchained,165.0,"Drama,Western",None,None,8.4,1211405
4,tt0848228,The Avengers,143.0,"Action,Adventure,Sci-Fi",None,None,8.1,1183655
...,...,...,...,...,...,...,...,...
69572,tt10043732,Oblepikhovoe leto,87.0,"Biography,Drama",None,None,6.4,5
69573,tt10011772,Balloons over Babylon,70.0,Documentary,None,None,8.2,5
69574,tt10010134,Versailles Rediscovered - The Sun King's Vanis...,52.0,Documentary,None,None,7.0,5
69575,tt0844699,Ivan Mosjoukine ou L'enfant du carnaval,67.0,Documentary,FR,None,9.0,5
69576,tt0276568,To Chase a Million,97.0,"Action,Drama",GB,None,7.4,5

In [116]:
df_m.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 62830 entries, 0 to 69576
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         62830 non-null  object
 1   primary_title    62830 non-null  object
 2   runtime_minutes  62830 non-null  float64
 3   genres           62391 non-null  object
 4   region           27861 non-null  object
 5   language         0 non-null      object
 6   av_rating        62830 non-null  float64
 7   num_votes        62830 non-null  int64
dtypes: float64(2), int64(1), object(5)
memory usage: 4.3+ MB

In [117]:
#Data cleaning : Let's cleann the genres column
df_m['genres'] = df_m['genres'].str.split(',')

In [118]:
df_m = df_m[df_m['genres'].notnull()]

In [119]:
df_m = df_m.explode('genres')

In [121]:
df_m.to_sql('cleaned_movies', conn, if_exists='replace')
df_m

,movie_id,primary_title,runtime_minutes,genres,region,language,av_rating,num_votes
0,tt1375666,Inception,148.0,Action,None,None,8.8,1841066
0,tt1375666,Inception,148.0,Adventure,None,None,8.8,1841066
0,tt1375666,Inception,148.0,Sci-Fi,None,None,8.8,1841066
1,tt1345836,The Dark Knight Rises,164.0,Action,None,None,8.4,1387769
1,tt1345836,The Dark Knight Rises,164.0,Thriller,None,None,8.4,1387769
...,...,...,...,...,...,...,...,...
69573,tt10011772,Balloons over Babylon,70.0,Documentary,None,None,8.2,5
69574,tt10010134,Versailles Rediscovered - The Sun King's Vanis...,52.0,Documentary,None,None,7.0,5
69575,tt0844699,Ivan Mosjoukine ou L'enfant du carnaval,67.0,Documentary,FR,None,9.0,5
69576,tt0276568,To Chase a Million,97.0,Action,GB,None,7.4,5
69576,tt0276568,To Chase a Million,97.0,Drama,GB,None,7.4,5

In [122]:
#df_m.to_csv('movie_clean-a.csv')

In [ ]:
import matplotlib.pyplot as plt


# Plot the 'num_votes' column
plt.plot(df_5b['num_votes'], marker='o', linestyle='-')

# Add labels and title
plt.xlabel('Index')
plt.ylabel('Number of Votes')
plt.title('popularity by num_votes')

# Show the plot
plt.show()

In [ ]:

# bar chart 
fig, ax = plt.subplots(figsize=(12, 8))
ax.bar(df_5['genres'].values, df_5['num_votes'])
ax.set_ylabel('Number of Movies')
ax.set_title('Popularity of movies by Genre')
ax.set_xticklabels(df_5['genres'].index, rotation=45, ha='right')

# show plot
plt.show()

## Reading Bom.movies database

In [126]:
df_mg = pd.read_csv('../Data/bom.movie_gross.csv.gz')

In [127]:
df_mg

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [128]:
df_mg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [129]:
df_mg.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [130]:
df_mg.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [131]:
columns_to_drop_na = ['title', 'studio', 'domestic_gross', 'foreign_gross', 'year']
df_mg.dropna(subset=columns_to_drop_na, inplace=True)
df_mg.isna().sum()

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [132]:
df_mg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   object
 4   year            2007 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 94.1+ KB

In [133]:
df_mg

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3275,I Still See You,LGF,1400.0,1500000,2018
3286,The Catcher Was a Spy,IFC,725000.0,229000,2018
3309,Time Freak,Grindstone,10000.0,256000,2018
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200,2018
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000,2018

In [134]:
df_mg['domestic_gross'] = pd.to_numeric(df_mg['domestic_gross'], errors='coerce').fillna(0).astype(int)
df_mg['foreign_gross'] = pd.to_numeric(df_mg['foreign_gross'], errors='coerce').fillna(0).astype(int)

In [135]:
df_mg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   int64
 3   foreign_gross   2007 non-null   int64
 4   year            2007 non-null   int64
dtypes: int64(3), object(2)
memory usage: 94.1+ KB

In [136]:
df_mg['total_gross'] = df_mg['domestic_gross'] + df_mg['foreign_gross']

In [137]:
df_gross= df_mg.head(20)

In [138]:
df_gross

,title,studio,domestic_gross,foreign_gross,year,total_gross
0,Toy Story 3,BV,415000000,652000000,2010,1067000000
1,Alice in Wonderland (2010),BV,334200000,691300000,2010,1025500000
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000,664300000,2010,960300000
3,Inception,WB,292600000,535700000,2010,828300000
4,Shrek Forever After,P/DW,238700000,513900000,2010,752600000
5,The Twilight Saga: Eclipse,Sum.,300500000,398000000,2010,698500000
6,Iron Man 2,Par.,312400000,311500000,2010,623900000
7,Tangled,BV,200800000,391000000,2010,591800000
8,Despicable Me,Uni.,251500000,291600000,2010,543100000
9,How to Train Your Dragon,P/DW,217600000,277300000,2010,494900000
10,Clash of the Titans (2010),WB,163200000,330000000,2010,493200000
11,The Chronicles of Narnia: The Voyage of the Da...,Fox,104400000,311300000,2010,415700000
12,The King's Speech,Wein.,135500000,275400000,2010,410900000
13,Tron Legacy,BV,172100000,228000000,2010,400100000
14,The Karate Kid,Sony,176600000,182500000,2010,359100000
15,Prince of Persia: The Sands of Time,BV,90800000,245600000,2010,336400000
16,Black Swan,FoxS,107000000,222400000,2010,329400000
17,Megamind,P/DW,148400000,173500000,2010,321900000
18,Robin Hood,Uni.,105300000,216400000,2010,321700000
19,The Last Airbender,Par.,131800000,187900000,2010,319700000

In [ ]:
#df_gross.to_csv('movie_gross.csv')

## Reading the rt.reviews

In [140]:
df_rt = pd.read_csv('../Data/rt.reviews.tsv.gz', sep='\t', encoding='latin-1')

In [141]:
df_rt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

In [142]:
df_rt

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [143]:
df_rt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

In [ ]:
df_rt.columns

In [144]:
columns_to_drop_na = ['id', 'review', 'rating', 'fresh', 'critic', 'top_critic', 'publisher',
       'date']
df_rt.dropna(subset=columns_to_drop_na, inplace=True)

In [145]:
df_rt.shape

(33988, 8)

In [146]:
df_rt.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 33988 entries, 0 to 54424
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          33988 non-null  int64
 1   review      33988 non-null  object
 2   rating      33988 non-null  object
 3   fresh       33988 non-null  object
 4   critic      33988 non-null  object
 5   top_critic  33988 non-null  int64
 6   publisher   33988 non-null  object
 7   date        33988 non-null  object
dtypes: int64(2), object(6)
memory usage: 2.3+ MB

In [148]:
df_rt['top_critic'].unique()

array([0, 1])

In [149]:
df_rt = df_rt[df_rt['top_critic'] >= 1]

In [150]:
df_rt

,id,review,rating,fresh,critic,top_critic,publisher,date
24,3,"The rapid dialogue is dry and mannered, like a...",2.5/4,rotten,Joe Williams,1,St. Louis Post-Dispatch,"September 6, 2012"
47,3,It feels like each and every moment bursts for...,2/4,rotten,Stephanie Merry,1,Washington Post,"August 24, 2012"
50,3,"There's not really a movie there, nothing that...",2/4,rotten,Mick LaSalle,1,San Francisco Chronicle,"August 23, 2012"
54,3,The film is all too faithful to its un-cinemat...,1.5/4,rotten,Colin Covert,1,Minneapolis Star Tribune,"August 23, 2012"
55,3,"Cosmopolis,"" because of its allegiance to the ...",2/4,rotten,Moira MacDonald,1,Seattle Times,"August 23, 2012"
...,...,...,...,...,...,...,...,...
54410,2000,"A silly, cross-cultural shoot-'em-up -- the so...",2/4,fresh,Jonathan Curiel,1,San Francisco Chronicle,"October 4, 2002"
54411,2000,Don't let the subtitles fool you; the movie on...,2/4,rotten,John Monaghan,1,Detroit Free Press,"October 4, 2002"
54419,2000,"Sleek, shallow, but frequently amusing.",2.5/4,fresh,Gene Seymour,1,Newsday,"September 27, 2002"
54420,2000,The spaniel-eyed Jean Reno infuses Hubert with...,3/4,fresh,Megan Turner,1,New York Post,"September 27, 2002"
54424,2000,Dawdles and drags when it should pop; it doesn...,1.5/5,rotten,Manohla Dargis,1,Los Angeles Times,"September 26, 2002"

In [151]:
df_rt['top_critic'].value_counts

<bound method IndexOpsMixin.value_counts of 24       1
47       1
50       1
54       1
55       1
        ..
54410    1
54411    1
54419    1
54420    1
54424    1
Name: top_critic, Length: 7177, dtype: int64>

In [152]:
df_rt['rating'].value_counts()[20:40]

4.5/5     67
5/5       62
D+        62
1.5/5     61
D         57
A         52
0.5/4     32
0/4       30
F         13
3/6       12
0.5/5      9
D-         9
2/6        8
4/6        7
0/5        6
6          4
4/10       3
5/6        3
8          3
7.5/10     2
Name: rating, dtype: int64

Empty DataFrame
Columns: [title, studio, domestic_gross, foreign_gross, year, total_gross]
Index: []

In [154]:
df_rt 
df_mg 

# Inner join based on the 'ID' column
result = pd.merge(df_rt, df_mg , on='ID', how='inner')

# Display the result
print(result)

KeyError: 'ID'

In [155]:
# Convert 'rating' column to numeric values, coerce non-numeric values to NaN
#df_rt.loc[:, 'rating'] = pd.to_numeric(df_rt['rating'], errors='coerce')

# Drop rows where 'rating' is not numeric
#df_rt = df_rt.dropna(subset=['rating'])

In [ ]:
df_rt['rating']

In [ ]:
df[df.duplicated()]